Tekla.Structures.Drawing.ModelObjectHatchAttributes
The ModelObjectHatchAttributes class contains hatch attributes for model object hatches.

Tekla.Structures.Drawing.ModelObjectHatchAttributes.AutomaticScaling
Specifies whether automatic scaling is enabled. If disabled, custom
scale values will be used (see Tekla.Structures.Drawing.HatchAttributes.ScaleX and Tekla.Structures.Drawing.HatchAttributes.ScaleY).

Tekla.Structures.Drawing.ModelObjectHatchAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.